src/main/java/ru/vk/itmo/test/timofeevkirill/results/task4/wrk2/put/async_115_000rps
./wrk -d 1m -t 8 -c 64 -R 115000 -s /home/aphirri/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/timofeevkirill/scripts/lua/put.lua -L http://localhost:8080/v0/entry
Running 1m test @ http://localhost:8080/v0/entry
  8 threads and 64 connections
  Thread calibration: mean lat.: 7.860ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 8.513ms, rate sampling interval: 75ms
  Thread calibration: mean lat.: 7.887ms, rate sampling interval: 62ms
  Thread calibration: mean lat.: 8.194ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 8.370ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 8.815ms, rate sampling interval: 79ms
  Thread calibration: mean lat.: 8.628ms, rate sampling interval: 76ms
  Thread calibration: mean lat.: 7.683ms, rate sampling interval: 60ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  695.27us  14.18ms   76.13%
    Req/Sec    14.48k   195.61    15.88k    72.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.13ms
 75.000%    1.59ms
 90.000%    2.10ms
 99.000%    3.41ms
 99.900%    6.64ms
 99.990%   10.10ms
 99.999%   11.50ms
100.000%   14.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.058     0.000000            2         1.00
       0.548     0.100000       576739         1.11
       0.697     0.200000      1151783         1.25
       0.840     0.300000      1725569         1.43
       0.982     0.400000      2301645         1.67
       1.127     0.500000      2874274         2.00
       1.204     0.550000      3162329         2.22
       1.285     0.600000      3448158         2.50
       1.374     0.650000      3736784         2.86
       1.472     0.700000      4022929         3.33
       1.585     0.750000      4309781         4.00
       1.649     0.775000      4454651         4.44
       1.718     0.800000      4597665         5.00
       1.794     0.825000      4741126         5.71
       1.879     0.850000      4883794         6.67
       1.978     0.875000      5027626         8.00
       2.034     0.887500      5099122         8.89
       2.099     0.900000      5172945        10.00
       2.169     0.912500      5243068        11.43
       2.253     0.925000      5315313        13.33
       2.351     0.937500      5386357        16.00
       2.409     0.943750      5422334        17.78
       2.473     0.950000      5458544        20.00
       2.545     0.956250      5494616        22.86
       2.627     0.962500      5530016        26.67
       2.725     0.968750      5565847        32.00
       2.783     0.971875      5584018        35.56
       2.849     0.975000      5602190        40.00
       2.923     0.978125      5619860        45.71
       3.011     0.981250      5637691        53.33
       3.119     0.984375      5655594        64.00
       3.187     0.985938      5664756        71.11
       3.263     0.987500      5673599        80.00
       3.349     0.989062      5682492        91.43
       3.451     0.990625      5691534       106.67
       3.575     0.992188      5700488       128.00
       3.651     0.992969      5704997       142.22
       3.741     0.993750      5709506       160.00
       3.845     0.994531      5713956       182.86
       3.973     0.995313      5718410       213.33
       4.147     0.996094      5722933       256.00
       4.255     0.996484      5725164       284.44
       4.387     0.996875      5727365       320.00
       4.559     0.997266      5729634       365.71
       4.783     0.997656      5731875       426.67
       5.099     0.998047      5734117       512.00
       5.291     0.998242      5735228       568.89
       5.527     0.998437      5736344       640.00
       5.823     0.998633      5737473       731.43
       6.203     0.998828      5738585       853.33
       6.703     0.999023      5739708      1024.00
       7.019     0.999121      5740271      1137.78
       7.347     0.999219      5740835      1280.00
       7.671     0.999316      5741392      1462.86
       8.067     0.999414      5741953      1706.67
       8.415     0.999512      5742519      2048.00
       8.599     0.999561      5742797      2275.56
       8.799     0.999609      5743078      2560.00
       9.015     0.999658      5743358      2925.71
       9.255     0.999707      5743635      3413.33
       9.463     0.999756      5743914      4096.00
       9.567     0.999780      5744054      4551.11
       9.671     0.999805      5744204      5120.00
       9.759     0.999829      5744337      5851.43
       9.871     0.999854      5744479      6826.67
       9.983     0.999878      5744614      8192.00
      10.039     0.999890      5744686      9102.22
      10.111     0.999902      5744765     10240.00
      10.167     0.999915      5744830     11702.86
      10.263     0.999927      5744900     13653.33
      10.359     0.999939      5744968     16384.00
      10.415     0.999945      5745010     18204.44
      10.471     0.999951      5745038     20480.00
      10.519     0.999957      5745072     23405.71
      10.575     0.999963      5745104     27306.67
      10.655     0.999969      5745139     32768.00
      10.703     0.999973      5745158     36408.89
      10.735     0.999976      5745178     40960.00
      10.791     0.999979      5745196     46811.43
      10.847     0.999982      5745209     54613.33
      10.943     0.999985      5745228     65536.00
      11.047     0.999986      5745236     72817.78
      11.119     0.999988      5745244     81920.00
      11.391     0.999989      5745253     93622.86
      11.647     0.999991      5745262    109226.67
      11.855     0.999992      5745272    131072.00
      11.975     0.999993      5745275    145635.56
      12.087     0.999994      5745279    163840.00
      12.215     0.999995      5745284    187245.71
      12.383     0.999995      5745288    218453.33
      12.535     0.999996      5745293    262144.00
      12.655     0.999997      5745295    291271.11
      12.783     0.999997      5745297    327680.00
      12.887     0.999997      5745299    374491.43
      13.015     0.999998      5745301    436906.67
      13.183     0.999998      5745304    524288.00
      13.207     0.999998      5745305    582542.22
      13.239     0.999998      5745306    655360.00
      13.255     0.999999      5745307    748982.86
      13.335     0.999999      5745308    873813.33
      13.415     0.999999      5745309   1048576.00
      13.511     0.999999      5745310   1165084.44
      13.511     0.999999      5745310   1310720.00
      13.647     0.999999      5745311   1497965.71
      13.647     0.999999      5745311   1747626.67
      13.783     1.000000      5745312   2097152.00
      13.783     1.000000      5745312   2330168.89
      13.783     1.000000      5745312   2621440.00
      14.007     1.000000      5745313   2995931.43
      14.007     1.000000      5745313   3495253.33
      14.007     1.000000      5745313   4194304.00
      14.007     1.000000      5745313   4660337.78
      14.007     1.000000      5745313   5242880.00
      14.183     1.000000      5745314   5991862.86
      14.183     1.000000      5745314          inf
#[Mean    =        1.255, StdDeviation   =        0.695]
#[Max     =       14.176, Total count    =      5745314]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6897803 requests in 1.00m, 440.74MB read
Requests/sec: 114967.11
Transfer/sec:      7.35MB